## Plan Result (demo-frontdoor)




<pre><code>Plan: 10 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;c100-application&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-test-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo"
        name                                 = "sdshmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend"
          + load_balancing_name = "loadBalancingSettings-pip-frontend"
          + name                = "pip-frontend"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pip-frontend.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-c100-application"
          + load_balancing_name = "loadBalancingSettings-c100-application"
          + name                = "c100-application"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "c100-application.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-admin-web"
          + load_balancing_name = "loadBalancingSettings-vh-admin-web"
          + name                = "vh-admin-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-admin-web.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-test-web"
          + load_balancing_name = "loadBalancingSettings-vh-test-web"
          + name                = "vh-test-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-test-web.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"
          + load_balancing_name = "loadBalancingSettings-vh-video-web"
          + name                = "vh-video-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-c100-application"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-admin-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-test-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-video-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-pip-frontend"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-c100-application"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-vh-admin-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-vh-test-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-vh-video-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + host_name                               = "pip-frontend.demo.platform.hmcts.net"
          + name                                    = "pip-frontend"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "c100-application.demo.platform.hmcts.net"
          + name                                    = "c100-application"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-admin-web.demo.platform.hmcts.net"
          + name                                    = "vh-admin-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-test-web.demo.platform.hmcts.net"
          + name                                    = "vh-test-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-video-web.demo.platform.hmcts.net"
          + name                                    = "vh-video-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "pip-frontend",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "pip-frontend"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "pip-frontend"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "portal-demo",
              + "c100-application",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/portal-demoHttpsRedirect"
          ~ name               = "portal-demoHttpsRedirect" -> "c100-application"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "c100-application"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "toffee",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "vh-admin-web"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "vh-admin-web"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + name               = "vh-test-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-test-web"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + name               = "vh-video-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-video-web"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + name               = "sds-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal-demo",
            ]
          + name               = "portal-demoHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + name               = "toffeeHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pip-frontend",
            ]
          + name               = "pip-frontendHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "c100-application",
            ]
          + name               = "c100-applicationHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-admin-web",
            ]
          + name               = "vh-admin-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + name               = "vh-test-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + name               = "vh-video-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (21 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["c100-application"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/c100-application"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pip-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/pip-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/vh-admin-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-test-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/vh-test-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/vh-video-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["c100-application"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "c100applicationdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "pipfrontenddemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ enabled                           = false -> true
        id                                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeedemo"
        name                              = "toffeedemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhtestwebdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 10 to add, 3 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ enabled                           = true -> false
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/sdshmcts-demo/frontendendpoints/toffee",
        ]
        id                                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeedemo"
        name                              = "toffeedemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":361,"Program":"tfcmt","SHA1":"","Target":"demo-frontdoor","Vars":{}} -->